TexasInstruments/c2000ware-core-sdk/driverlib/f28p551x/driverlib/inc/hw_adc.h
//###########################################################################
//
// FILE:    hw_adc.h
//
// TITLE:   Definitions for the ADC registers.
//
//###########################################################################
// $Copyright:
// Copyright (C) 2026 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_ADC_H
#define HW_ADC_H

//*************************************************************************************************
//
// The following are defines for the ADC register offsets
//
//*************************************************************************************************
#define ADC_O_CTL1                0x0U     // ADC Control 1 Register
#define ADC_O_CTL2                0x1U     // ADC Control 2 Register
#define ADC_O_BURSTCTL            0x6U     // ADC Burst Control Register
#define ADC_O_INTFLG              0x7U     // ADC Interrupt Flag Register
#define ADC_O_INTFLGCLR           0x8U     // ADC Interrupt Flag Clear Register
#define ADC_O_INTOVF              0x9U     // ADC Interrupt Overflow Register
#define ADC_O_INTOVFCLR           0xAU     // ADC Interrupt Overflow Clear Register
#define ADC_O_INTSEL1N2           0xBU     // ADC Interrupt 1 and 2 Selection Register
#define ADC_O_INTSEL3N4           0xCU     // ADC Interrupt 3 and 4 Selection Register
#define ADC_O_SOCPRICTL           0xDU     // ADC SOC Priority Control Register
#define ADC_O_INTSOCSEL1          0xEU     // ADC Interrupt SOC Selection 1 Register
#define ADC_O_SOCFLG1             0x12U    // ADC SOC Flag 1 Register
#define ADC_O_SOCFRC1             0x14U    // ADC SOC Force 1 Register
#define ADC_O_SOCOVF1             0x16U    // ADC SOC Overflow 1 Register
#define ADC_O_SOCOVFCLR1          0x18U    // ADC SOC Overflow Clear 1 Register
#define ADC_O_SOC0CTL             0x1AU    // ADC SOC0 Control Register
#define ADC_O_SOC1CTL             0x1CU    // ADC SOC1 Control Register
#define ADC_O_SOC2CTL             0x1EU    // ADC SOC2 Control Register
#define ADC_O_SOC3CTL             0x20U    // ADC SOC3 Control Register
#define ADC_O_SOC4CTL             0x22U    // ADC SOC4 Control Register
#define ADC_O_SOC5CTL             0x24U    // ADC SOC5 Control Register
#define ADC_O_SOC6CTL             0x26U    // ADC SOC6 Control Register
#define ADC_O_SOC7CTL             0x28U    // ADC SOC7 Control Register
#define ADC_O_SOC8CTL             0x2AU    // ADC SOC8 Control Register
#define ADC_O_SOC9CTL             0x2CU    // ADC SOC9 Control Register
#define ADC_O_SOC10CTL            0x2EU    // ADC SOC10 Control Register
#define ADC_O_SOC11CTL            0x30U    // ADC SOC11 Control Register
#define ADC_O_SOC12CTL            0x32U    // ADC SOC12 Control Register
#define ADC_O_SOC13CTL            0x34U    // ADC SOC13 Control Register
#define ADC_O_SOC14CTL            0x36U    // ADC SOC14 Control Register
#define ADC_O_SOC15CTL            0x38U    // ADC SOC15 Control Register
#define ADC_O_EVTSTAT             0x5AU    // ADC Event Status Register
#define ADC_O_EVTCLR              0x5CU    // ADC Event Clear Register
#define ADC_O_EVTSEL              0x5EU    // ADC Event Selection Register
#define ADC_O_EVTINTSEL           0x60U    // ADC Event Interrupt Selection Register
#define ADC_O_COUNTER             0x63U    // ADC Counter Register
#define ADC_O_REV                 0x64U    // ADC Revision Register
#define ADC_O_OFFTRIM             0x65U    // ADC Offset Trim Register
#define ADC_O_CONFIG2             0x66U    // ADC Config Register Upper 32 bits
#define ADC_O_PPB1CONFIG          0x6AU    // ADC PPB{#} Config Register
#define ADC_O_PPB1STAMP           0x6BU    // ADC PPB1 Sample Delay Time Stamp Register
#define ADC_O_PPB1OFFCAL          0x6CU    // ADC PPB1 Offset Calibration Register
#define ADC_O_PPB1OFFREF          0x6DU    // ADC PPB1 Offset Reference Register
#define ADC_O_PPB1TRIPHI          0x6EU    // ADC PPB1 Trip High Register
#define ADC_O_PPB1TRIPLO          0x70U    // ADC PPB1 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPBTRIP1FILCTL      0x72U    // ADCEVT1 Trip High Filter Control Register
#define ADC_O_PPBTRIP1FILCLKCTL   0x74U    // ADCEVT1 Trip High Filter Prescale Control Register
#define ADC_O_PPB2CONFIG          0x7AU    // ADC PPB{#} Config Register
#define ADC_O_PPB2STAMP           0x7BU    // ADC PPB2 Sample Delay Time Stamp Register
#define ADC_O_PPB2OFFCAL          0x7CU    // ADC PPB2 Offset Calibration Register
#define ADC_O_PPB2OFFREF          0x7DU    // ADC PPB2 Offset Reference Register
#define ADC_O_PPB2TRIPHI          0x7EU    // ADC PPB2 Trip High Register
#define ADC_O_PPB2TRIPLO          0x80U    // ADC PPB2 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPBTRIP2FILCTL      0x82U    // ADCEVT2 Trip High Filter Control Register
#define ADC_O_PPBTRIP2FILCLKCTL   0x84U    // ADCEVT2 Trip High Filter Prescale Control Register
#define ADC_O_PPB3CONFIG          0x8AU    // ADC PPB{#} Config Register
#define ADC_O_PPB3STAMP           0x8BU    // ADC PPB3 Sample Delay Time Stamp Register
#define ADC_O_PPB3OFFCAL          0x8CU    // ADC PPB3 Offset Calibration Register
#define ADC_O_PPB3OFFREF          0x8DU    // ADC PPB3 Offset Reference Register
#define ADC_O_PPB3TRIPHI          0x8EU    // ADC PPB3 Trip High Register
#define ADC_O_PPB3TRIPLO          0x90U    // ADC PPB3 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPBTRIP3FILCTL      0x92U    // ADCEVT3 Trip High Filter Control Register
#define ADC_O_PPBTRIP3FILCLKCTL   0x94U    // ADCEVT3 Trip High Filter Prescale Control Register
#define ADC_O_PPB4CONFIG          0x9AU    // ADC PPB{#} Config Register
#define ADC_O_PPB4STAMP           0x9BU    // ADC PPB4 Sample Delay Time Stamp Register
#define ADC_O_PPB4OFFCAL          0x9CU    // ADC PPB4 Offset Calibration Register
#define ADC_O_PPB4OFFREF          0x9DU    // ADC PPB4 Offset Reference Register
#define ADC_O_PPB4TRIPHI          0x9EU    // ADC PPB4 Trip High Register
#define ADC_O_PPB4TRIPLO          0xA0U    // ADC PPB4 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPBTRIP4FILCTL      0xA2U    // ADCEVT4 Trip High Filter Control Register
#define ADC_O_PPBTRIP4FILCLKCTL   0xA4U    // ADCEVT4 Trip High Filter Prescale Control Register
#define ADC_O_INTCYCLE            0xB9U    // ADC Early Interrupt Generation Cycle
#define ADC_O_INLTRIM1            0xBAU    // ADC Linearity Trim 1 Register
#define ADC_O_INLTRIM2            0xBCU    // ADC Linearity Trim 2 Register
#define ADC_O_INLTRIM3            0xBEU    // ADC Linearity Trim 3 Register
#define ADC_O_INLTRIM4            0xC0U    // ADC Linearity Trim 4 Register
#define ADC_O_INLTRIM5            0xC2U    // ADC Linearity Trim 5 Register
#define ADC_O_INLTRIM6            0xC4U    // ADC Linearity Trim 6 Register
#define ADC_O_REV2                0xC7U    // ADC Wrapper Revision Register
#define ADC_O_REP1CTL             0xCAU    // ADC Trigger Repeater 1 Control Register
#define ADC_O_REP1N               0xCCU    // ADC Trigger Repeater 1 N Select Register
#define ADC_O_REP1PHASE           0xCEU    // ADC Trigger Repeater 1 Phase Select Register
#define ADC_O_REP1SPREAD          0xD0U    // ADC Trigger Repeater 1 Spread Select Register
#define ADC_O_REP1FRC             0xD2U    // ADC Trigger Repeater 1 Software Force Register
#define ADC_O_REP2CTL             0xDAU    // ADC Trigger Repeater 2 Control Register
#define ADC_O_REP2N               0xDCU    // ADC Trigger Repeater 2 N Select Register
#define ADC_O_REP2PHASE           0xDEU    // ADC Trigger Repeater 2 Phase Select Register
#define ADC_O_REP2SPREAD          0xE0U    // ADC Trigger Repeater 2 Spread Select Register
#define ADC_O_REP2FRC             0xE2U    // ADC Trigger Repeater 2 Software Force Register
#define ADC_O_PPB1LIMIT           0xEAU    // ADC PPB1Conversion Count Limit Register
#define ADC_O_PPBP1PCOUNT         0xECU    // ADC PPB1 Partial Conversion Count Register
#define ADC_O_PPB1CONFIG2         0xEEU    // ADC PPB1 Sum Shift Register
#define ADC_O_PPB1PSUM            0xF0U    // ADC PPB1 Partial Sum Register
#define ADC_O_PPB1PMAX            0xF2U    // ADC PPB1 Partial Max Register
#define ADC_O_PPB1PMAXI           0xF4U    // ADC PPB1 Partial Max Index Register
#define ADC_O_PPB1PMIN            0xF6U    // ADC PPB1 Partial MIN Register
#define ADC_O_PPB1PMINI           0xF8U    // ADC PPB1 Partial Min Index Register
#define ADC_O_PPB1TRIPLO2         0xFAU    // ADC PPB1 Extended Trip Low Register
#define ADC_O_PPB2LIMIT           0x104U   // ADC PPB2Conversion Count Limit Register
#define ADC_O_PPBP2PCOUNT         0x106U   // ADC PPB2 Partial Conversion Count Register
#define ADC_O_PPB2CONFIG2         0x108U   // ADC PPB2 Sum Shift Register
#define ADC_O_PPB2PSUM            0x10AU   // ADC PPB2 Partial Sum Register
#define ADC_O_PPB2PMAX            0x10CU   // ADC PPB2 Partial Max Register
#define ADC_O_PPB2PMAXI           0x10EU   // ADC PPB2 Partial Max Index Register
#define ADC_O_PPB2PMIN            0x110U   // ADC PPB2 Partial MIN Register
#define ADC_O_PPB2PMINI           0x112U   // ADC PPB2 Partial Min Index Register
#define ADC_O_PPB2TRIPLO2         0x114U   // ADC PPB2 Extended Trip Low Register
#define ADC_O_PPB3LIMIT           0x11EU   // ADC PPB3Conversion Count Limit Register
#define ADC_O_PPBP3PCOUNT         0x120U   // ADC PPB3 Partial Conversion Count Register
#define ADC_O_PPB3CONFIG2         0x122U   // ADC PPB3 Sum Shift Register
#define ADC_O_PPB3PSUM            0x124U   // ADC PPB3 Partial Sum Register
#define ADC_O_PPB3PMAX            0x126U   // ADC PPB3 Partial Max Register
#define ADC_O_PPB3PMAXI           0x128U   // ADC PPB3 Partial Max Index Register
#define ADC_O_PPB3PMIN            0x12AU   // ADC PPB3 Partial MIN Register
#define ADC_O_PPB3PMINI           0x12CU   // ADC PPB3 Partial Min Index Register
#define ADC_O_PPB3TRIPLO2         0x12EU   // ADC PPB3 Extended Trip Low Register
#define ADC_O_PPB4LIMIT           0x138U   // ADC PPB4Conversion Count Limit Register
#define ADC_O_PPBP4PCOUNT         0x13AU   // ADC PPB4 Partial Conversion Count Register
#define ADC_O_PPB4CONFIG2         0x13CU   // ADC PPB4 Sum Shift Register
#define ADC_O_PPB4PSUM            0x13EU   // ADC PPB4 Partial Sum Register
#define ADC_O_PPB4PMAX            0x140U   // ADC PPB4 Partial Max Register
#define ADC_O_PPB4PMAXI           0x142U   // ADC PPB4 Partial Max Index Register
#define ADC_O_PPB4PMIN            0x144U   // ADC PPB4 Partial MIN Register
#define ADC_O_PPB4PMINI           0x146U   // ADC PPB4 Partial Min Index Register
#define ADC_O_PPB4TRIPLO2         0x148U   // ADC PPB4 Extended Trip Low Register

#define ADC_O_RESULT0      0x0U    // ADC Result 0 Register
#define ADC_O_RESULT1      0x1U    // ADC Result 1 Register
#define ADC_O_RESULT2      0x2U    // ADC Result 2 Register
#define ADC_O_RESULT3      0x3U    // ADC Result 3 Register
#define ADC_O_RESULT4      0x4U    // ADC Result 4 Register
#define ADC_O_RESULT5      0x5U    // ADC Result 5 Register
#define ADC_O_RESULT6      0x6U    // ADC Result 6 Register
#define ADC_O_RESULT7      0x7U    // ADC Result 7 Register
#define ADC_O_RESULT8      0x8U    // ADC Result 8 Register
#define ADC_O_RESULT9      0x9U    // ADC Result 9 Register
#define ADC_O_RESULT10     0xAU    // ADC Result 10 Register
#define ADC_O_RESULT11     0xBU    // ADC Result 11 Register
#define ADC_O_RESULT12     0xCU    // ADC Result 12 Register
#define ADC_O_RESULT13     0xDU    // ADC Result 13 Register
#define ADC_O_RESULT14     0xEU    // ADC Result 14 Register
#define ADC_O_RESULT15     0xFU    // ADC Result 15 Register
#define ADC_O_PPB1RESULT   0x20U   // ADC Post Processing Block 1 Result Register
#define ADC_O_PPB2RESULT   0x22U   // ADC Post Processing Block 2 Result Register
#define ADC_O_PPB3RESULT   0x24U   // ADC Post Processing Block 3 Result Register
#define ADC_O_PPB4RESULT   0x26U   // ADC Post Processing Block 4 Result Register
#define ADC_O_PPB1SUM      0x28U   // ADC PPB 1 Final Sum Result Register
#define ADC_O_PPB1COUNT    0x2AU   // ADC PPB1 Final Conversion Count Register
#define ADC_O_PPB2SUM      0x2CU   // ADC PPB 2 Final Sum Result Register
#define ADC_O_PPB2COUNT    0x2EU   // ADC PPB2 Final Conversion Count Register
#define ADC_O_PPB3SUM      0x30U   // ADC PPB 3 Final Sum Result Register
#define ADC_O_PPB3COUNT    0x32U   // ADC PPB3 Final Conversion Count Register
#define ADC_O_PPB4SUM      0x34U   // ADC PPB 4 Final Sum Result Register
#define ADC_O_PPB4COUNT    0x36U   // ADC PPB4 Final Conversion Count Register
#define ADC_O_PPB1MAX      0x38U   // ADC PPB 1 Final Max Result Register
#define ADC_O_PPB1MAXI     0x3AU   // ADC PPB 1 Final Max Index Result Register
#define ADC_O_PPB1MIN      0x3CU   // ADC PPB 1 Final Min Result Register
#define ADC_O_PPB1MINI     0x3EU   // ADC PPB 1 Final Min Index Result Register
#define ADC_O_PPB2MAX      0x40U   // ADC PPB 2 Final Max Result Register
#define ADC_O_PPB2MAXI     0x42U   // ADC PPB 2 Final Max Index Result Register
#define ADC_O_PPB2MIN      0x44U   // ADC PPB 2 Final Min Result Register
#define ADC_O_PPB2MINI     0x46U   // ADC PPB 2 Final Min Index Result Register
#define ADC_O_PPB3MAX      0x48U   // ADC PPB 3 Final Max Result Register
#define ADC_O_PPB3MAXI     0x4AU   // ADC PPB 3 Final Max Index Result Register
#define ADC_O_PPB3MIN      0x4CU   // ADC PPB 3 Final Min Result Register
#define ADC_O_PPB3MINI     0x4EU   // ADC PPB 3 Final Min Index Result Register
#define ADC_O_PPB4MAX      0x50U   // ADC PPB 4 Final Max Result Register
#define ADC_O_PPB4MAXI     0x52U   // ADC PPB 4 Final Max Index Result Register
#define ADC_O_PPB4MIN      0x54U   // ADC PPB 4 Final Min Result Register
#define ADC_O_PPB4MINI     0x56U   // ADC PPB 4 Final Min Index Result Register


//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCTL1 register
//
//*************************************************************************************************
#define ADC_CTL1_INTPULSEPOS         0x4U      // ADC Interrupt Pulse Position
#define ADC_CTL1_ADCPWDNZ            0x80U     // ADC Power Down
#define ADC_CTL1_ADCBSYCHN_S         8U
#define ADC_CTL1_ADCBSYCHN_M         0xF00U    // ADC Busy Channel
#define ADC_CTL1_ADCBSY              0x2000U   // ADC Busy
#define ADC_CTL1_EXTMUXPRESELECTEN   0x4000U   // External Mux Preselect Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCTL2 register
//
//*************************************************************************************************
#define ADC_CTL2_PRESCALE_S   0U
#define ADC_CTL2_PRESCALE_M   0xFU   // ADC Clock Prescaler

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCBURSTCTL register
//
//*************************************************************************************************
#define ADC_BURSTCTL_BURSTTRIGSEL_S   0U
#define ADC_BURSTCTL_BURSTTRIGSEL_M   0x7FU     // SOC Burst Trigger Source Select
#define ADC_BURSTCTL_BURSTSIZE_S      8U
#define ADC_BURSTCTL_BURSTSIZE_M      0xF00U    // SOC Burst Size Select
#define ADC_BURSTCTL_BURSTEN          0x8000U   // SOC Burst Mode Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTFLG register
//
//*************************************************************************************************
#define ADC_INTFLG_ADCINT1         0x1U    // ADC Interrupt 1 Flag
#define ADC_INTFLG_ADCINT2         0x2U    // ADC Interrupt 2 Flag
#define ADC_INTFLG_ADCINT3         0x4U    // ADC Interrupt 3 Flag
#define ADC_INTFLG_ADCINT4         0x8U    // ADC Interrupt 4 Flag
#define ADC_INTFLG_ADCINT1RESULT   0x10U   // ADC Interrupt 1 Results Ready
#define ADC_INTFLG_ADCINT2RESULT   0x20U   // ADC Interrupt 2 Results Ready
#define ADC_INTFLG_ADCINT3RESULT   0x40U   // ADC Interrupt 3 Results Ready
#define ADC_INTFLG_ADCINT4RESULT   0x80U   // ADC Interrupt 4 Results Ready

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTFLGCLR register
//
//*************************************************************************************************
#define ADC_INTFLGCLR_ADCINT1   0x1U   // ADC Interrupt 1 Flag Clear
#define ADC_INTFLGCLR_ADCINT2   0x2U   // ADC Interrupt 2 Flag Clear
#define ADC_INTFLGCLR_ADCINT3   0x4U   // ADC Interrupt 3 Flag Clear
#define ADC_INTFLGCLR_ADCINT4   0x8U   // ADC Interrupt 4 Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTOVF register
//
//*************************************************************************************************
#define ADC_INTOVF_ADCINT1   0x1U   // ADC Interrupt 1 Overflow Flags
#define ADC_INTOVF_ADCINT2   0x2U   // ADC Interrupt 2 Overflow Flags
#define ADC_INTOVF_ADCINT3   0x4U   // ADC Interrupt 3 Overflow Flags
#define ADC_INTOVF_ADCINT4   0x8U   // ADC Interrupt 4 Overflow Flags

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTOVFCLR register
//
//*************************************************************************************************
#define ADC_INTOVFCLR_ADCINT1   0x1U   // ADC Interrupt 1 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT2   0x2U   // ADC Interrupt 2 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT3   0x4U   // ADC Interrupt 3 Overflow Clear Bits
#define ADC_INTOVFCLR_ADCINT4   0x8U   // ADC Interrupt 4 Overflow Clear Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSEL1N2 register
//
//*************************************************************************************************
#define ADC_INTSEL1N2_INT1SEL_S   0U
#define ADC_INTSEL1N2_INT1SEL_M   0x3FU     // ADCINT1 EOC Source Select
#define ADC_INTSEL1N2_INT1CONT    0x40U     // ADCINT1 Continue to Interrupt Mode
#define ADC_INTSEL1N2_INT1E       0x80U     // ADCINT1 Interrupt Enable
#define ADC_INTSEL1N2_INT2SEL_S   8U
#define ADC_INTSEL1N2_INT2SEL_M   0x3F00U   // ADCINT2 EOC Source Select
#define ADC_INTSEL1N2_INT2CONT    0x4000U   // ADCINT2 Continue to Interrupt Mode
#define ADC_INTSEL1N2_INT2E       0x8000U   // ADCINT2 Interrupt Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSEL3N4 register
//
//*************************************************************************************************
#define ADC_INTSEL3N4_INT3SEL_S   0U
#define ADC_INTSEL3N4_INT3SEL_M   0x3FU     // ADCINT3 EOC Source Select
#define ADC_INTSEL3N4_INT3CONT    0x40U     // ADCINT3 Continue to Interrupt Mode
#define ADC_INTSEL3N4_INT3E       0x80U     // ADCINT3 Interrupt Enable
#define ADC_INTSEL3N4_INT4SEL_S   8U
#define ADC_INTSEL3N4_INT4SEL_M   0x3F00U   // ADCINT4 EOC Source Select
#define ADC_INTSEL3N4_INT4CONT    0x4000U   // ADCINT4 Continue to Interrupt Mode
#define ADC_INTSEL3N4_INT4E       0x8000U   // ADCINT4 Interrupt Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCPRICTL register
//
//*************************************************************************************************
#define ADC_SOCPRICTL_SOCPRIORITY_S   0U
#define ADC_SOCPRICTL_SOCPRIORITY_M   0x1FU    // SOC Priority
#define ADC_SOCPRICTL_RRPOINTER_S     6U
#define ADC_SOCPRICTL_RRPOINTER_M     0x7C0U   // Round Robin Pointer

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCINTSOCSEL1 register
//
//*************************************************************************************************
#define ADC_INTSOCSEL1_SOC0_S    0U
#define ADC_INTSOCSEL1_SOC0_M    0x3U          // SOC0 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC1_S    2U
#define ADC_INTSOCSEL1_SOC1_M    0xCU          // SOC1 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC2_S    4U
#define ADC_INTSOCSEL1_SOC2_M    0x30U         // SOC2 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC3_S    6U
#define ADC_INTSOCSEL1_SOC3_M    0xC0U         // SOC3 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC4_S    8U
#define ADC_INTSOCSEL1_SOC4_M    0x300U        // SOC4 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC5_S    10U
#define ADC_INTSOCSEL1_SOC5_M    0xC00U        // SOC5 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC6_S    12U
#define ADC_INTSOCSEL1_SOC6_M    0x3000U       // SOC6 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC7_S    14U
#define ADC_INTSOCSEL1_SOC7_M    0xC000U       // SOC7 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC8_S    16U
#define ADC_INTSOCSEL1_SOC8_M    0x30000U      // SOC8 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC9_S    18U
#define ADC_INTSOCSEL1_SOC9_M    0xC0000U      // SOC9 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC10_S   20U
#define ADC_INTSOCSEL1_SOC10_M   0x300000U     // SOC10 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC11_S   22U
#define ADC_INTSOCSEL1_SOC11_M   0xC00000U     // SOC11 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC12_S   24U
#define ADC_INTSOCSEL1_SOC12_M   0x3000000U    // SOC12 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC13_S   26U
#define ADC_INTSOCSEL1_SOC13_M   0xC000000U    // SOC13 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC14_S   28U
#define ADC_INTSOCSEL1_SOC14_M   0x30000000U   // SOC14 ADC Interrupt Trigger Select
#define ADC_INTSOCSEL1_SOC15_S   30U
#define ADC_INTSOCSEL1_SOC15_M   0xC0000000U   // SOC15 ADC Interrupt Trigger Select

